# -*- coding:utf-8 -*-
# Created by steve @ 17-12-9 下午8:26
'''
                   _ooOoo_ 
                  o8888888o 
                  88" . "88 
                  (| -_- |) 
                  O\  =  /O 
               ____/`---'\____ 
             .'  \\|     |//  `. 
            /  \\|||  :  |||//  \ 
           /  _||||| -:- |||||-  \ 
           |   | \\\  -  /// |   | 
           | \_|  ''\---/''  |   | 
           \  .-\__  `-`  ___/-. / 
         ___`. .'  /--.--\  `. . __ 
      ."" '<  `.___\_<|>_/___.'  >'"". 
     | | :  `- \`.;`\ _ /`;.`/ - ` : | | 
     \  \ `-.   \_ __\ /__ _/   .-` /  / 
======`-.____`-.___\_____/___.-`____.-'====== 
                   `=---=' 
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ 
         佛祖保佑       永无BUG 
'''

import numpy as np

if __name__ == '__main__':
    a = 1
    b = 2
    aa = np.random.rand(4, 4)
    print(aa)
    global bb
    bb = aa


    def su(i, bb):
        # global aa
        # global a
        # global b
        # global bb
        bb[i, i] = aa[i, i] + a
        b = a


    map(su, range(4))
    print(aa, bb, a, b)
